// src/lib/mock-data.ts

// [L1코드, L1이름, L2코드, L2이름, L3코드, L3이름, L4코드, L4이름]
export const MOCK_HIERARCHY = [
  ['010', 'The미식', '10010', 'The미식 장인라면', '10020', '장인라면 얼큰한맛 봉지', '10000', '라면'],
  ['010', 'The미식', '10010', 'The미식 장인라면', '10000', '장인라면 담백한맛 봉지', '10000', '라면'],
  ['010', 'The미식', '10010', 'The미식 장인라면', '10030', '장인라면 얼큰한맛 컵', '10000', '라면'],
  ['010', 'The미식', '10010', 'The미식 장인라면', '10010', '장인라면 담백한맛 컵', '10000', '라면'],
  ['010', 'The미식', '10040', 'The미식 요리면', '10000', '유니자장면 봉지', '10000', '라면'],
  ['010', 'The미식', '10040', 'The미식 요리면', '10010', '유니자장면 컵', '10000', '라면'],
  ['010', 'The미식', '10120', 'The미식 국물요리(냉동)', '10000', '갈비탕', '10000', '조미식품(냉동)'],
  ['010', 'The미식', '10120', 'The미식 국물요리(냉동)', '10060', '양지육개장', '10000', '조미식품(냉동)'],
  ['010', 'The미식', '10120', 'The미식 국물요리(냉동)', '10080', '차돌된장찌개', '10000', '조미식품(냉동)'],
  ['010', 'The미식', '10120', 'The미식 국물요리(냉동)', '10090', '한우미역국', '10000', '조미식품(냉동)'],
  ['010', 'The미식', '10020', 'The미식 요리밥', '10020', '카오팟쌉빠롯', '10000', '냉동식품'],
  ['010', 'The미식', '10050', 'The미식 국물요리(상온)', '10040', '사골곰탕', '10000', '조미식품(상온)'],
  ['010', 'The미식', '10050', 'The미식 국물요리(상온)', '10110', '한우사골곰탕', '10000', '조미식품(상온)'],
  ['010', 'The미식', '10000', 'The미식 즉석밥', '10000', '백미밥', '10000', '즉석밥'],
  ['010', 'The미식', '10000', 'The미식 즉석밥', '10030', '귀리쌀밥', '10000', '즉석밥'],
  ['010', 'The미식', '10000', 'The미식 즉석밥', '10040', '메밀쌀밥', '10000', '즉석밥'],
  ['010', 'The미식', '10000', 'The미식 즉석밥', '10120', '흑미밥', '10000', '즉석밥'],
  ['010', 'The미식', '10000', 'The미식 즉석밥', '10070', '잡곡밥', '10000', '즉석밥'],
  ['010', 'The미식', '10000', 'The미식 즉석밥', '10020', '고시히카리밥', '10000', '즉석밥'],
  ['010', 'The미식', '10060', 'The미식 만두', '10060', '육즙고기교자', '10000', '냉동식품'],
  ['010', 'The미식', '10060', 'The미식 만두', '10070', '김치교자', '10000', '냉동식품'],
  ['020', '멜팅피스', '20000', '멜팅피스 튀김', '20030', '새우튀김', '20000', '냉동식품'],
  ['020', '멜팅피스', '20000', '멜팅피스 튀김', '20040', '순대튀김', '20000', '냉동식품'],
  ['020', '멜팅피스', '20010', '멜팅피스 핫도그', '20000', '오리지널', '20000', '냉동식품'],
  ['030', '푸디버디', '30000', '푸디버디 즉석밥', '30010', '유기농 쌀밥', '30000', '즉석밥'],
  ['030', '푸디버디', '30020', '푸디버디 면', '30000', '빨강라면 봉지', '30000', '라면'],
  ['030', '푸디버디', '30020', '푸디버디 면', '30010', '빨강라면 컵', '30000', '라면'],
  ['030', '푸디버디', '30040', '푸디버디 튀김', '30020', '숫자치킨너겟', '30000', '냉동식품'],
  ['030', '푸디버디', '30040', '푸디버디 튀김', '30000', '미니돈까스', '30000', '냉동식품'],
  ['030', '푸디버디', '30050', '푸디버디 핫도그', '30010', '미니핫도그', '30000', '냉동식품'],
  ['030', '푸디버디', '30010', '푸디버디 요리밥', '30000', '계란야채볶음밥', '30000', '냉동식품'],
  ['030', '푸디버디', '30030', '푸디버디 국물요리', '30040', '푸디버디 소고기미역국', '30000', '조미식품(상온)'],
  ['030', '푸디버디', '30060', '푸디버디 소스', '30000', '한우 짜장소스', '30000', '조미식품(상온)'],
  ['040', '하림', '40000', '하림 라면', '40010', '챔라면 컵', '40000', '라면'],
  ['040', '하림', '40000', '하림 라면', '40000', '사리면 봉지', '40000', '라면'],
  ['040', '하림', '40020', '맥시칸 소스', '40000', '양념치킨소스 오리지널', '40000', '조미식품(상온)'],
  ['040', '하림', '40040', '맥시칸 튀김', '40000', '크리스피 봉 (350g)', '40000', '냉동식품'],
  ['040', '하림', '40010', '하림 NPB 라면', '40010', '인생갓면', '40000', '라면'],
  ['050', 'OEM', '50020', 'OEM 국물요리', '50080', '갈비탕', '50000', '조미식품(냉동)'],
  ['050', 'OEM', '50090', 'OEM 소스', '50000', '소스', '50000', '조미식품(냉동)'],
  ['060', '세트', '60000', 'The미식 세트', '60030', '면세트', '60000', '세트'],
  ['060', '세트', '60000', 'The미식 세트', '60040', '복합세트', '60000', '세트'],
  ['070', '하림퍼스트키친', '70010', '하림', '70000', '하림가공', '70000', '식품'],
  ['090', '물류부자재', '90020', '아이스팩', '90000', '아이스팩', '90000', '아이스팩'],
  ['810', '반제품', '10000', '반제품', '10000', '반제품', '10000', '반제품'],
  ['990', '기타', '90000', '기타', '90000', '기타', '90000', '기타']
];

export const MOCK_MAT_GROUP = [
  { code: '101010', name: '계육' }, { code: '101011', name: '돈육' }, { code: '101012', name: '우육' }, { code: '101013', name: '기타 축산물' },
  { code: '101110', name: '수산물' }, { code: '101210', name: '양곡' }, { code: '101310', name: '기타원료' },
  { code: '201010', name: '농산물' }, { code: '201110', name: '엑기스류' }, { code: '201111', name: '당류' }, { code: '201112', name: '장류' },
  { code: '201113', name: '색소,향,첨가제' }, { code: '201114', name: '곡류가공품,전분' }, { code: '201115', name: '조미소재류' }, { code: '201116', name: '라면부재료' },
  { code: '201210', name: '소스류' }, { code: '201310', name: '유 류' }, { code: '201410', name: '기타부재료' },
  { code: '301010', name: 'K1 포장지' }, { code: '301011', name: 'K2 포장지' }, { code: '301012', name: 'K3 포장지' },
  { code: '301110', name: 'K1 종이박스' }, { code: '301111', name: 'K2 종이박스' }, { code: '301112', name: 'K3 종이박스' },
  { code: '301210', name: '트레이' }, { code: '301211', name: 'K3 종이컵' }, { code: '301212', name: '물류부자재' },
  { code: '301310', name: '스티커' }, { code: '301810', name: '기타포장재' }, { code: '301910', name: '금형 및 동판' },
  { code: '401010', name: '의약품' }, { code: '401110', name: '판촉물' }, { code: '401310', name: '전산용품' }, { code: '401410', name: '사무용품' },
  { code: '501010', name: '피복류' }, { code: '501011', name: '세척 및 소독제' }, { code: '501012', name: '생산소모품' },
  { code: '601010', name: '전기자재' }, { code: '601110', name: '배관자재(일반)' }, { code: '601210', name: '모터/펌프류' },
  { code: '700000', name: '반제품' },
  { code: '801010', name: '(제)만두류' }, { code: '801011', name: '(제)냉동밥류' }, { code: '801012', name: '(제)튀김류' },
  { code: '802010', name: '(제)즉석조리식품' }, { code: '803010', name: '(제)복합 세트' },
  { code: '804010', name: '(제)라면' }, { code: '804011', name: '(제)밥' }, { code: '805012', name: '(제)소스&양념' },
  { code: '900000', name: '상품' }, { code: '901010', name: '미식마켓' }, { code: '902010', name: 'OEM/ODM' }
];

export const MOCK_REF_DATA = {
  mrp: [
    { code: 'M01', name: '냉동밥' }, { code: 'M02', name: '주먹밥' }, { code: 'M03', name: '냉동만두' },
    { code: 'M04', name: '튀김' }, { code: 'M05', name: '핫도그' }, { code: 'M06', name: '추출/농축' },
    { code: 'M07', name: 'HMI' }, { code: 'M08', name: '소스' }, { code: 'M09', name: '분말' },
    { code: 'M10', name: '냉장만두' }, { code: 'M11', name: '건면봉지' }, { code: 'M12', name: '유탕봉지' },
    { code: 'M13', name: '전처리' }, { code: 'M14', name: '건면컵' }, { code: 'M15', name: '유탕컵' },
    { code: 'M16', name: '요리봉지' }, { code: 'M17', name: '요리컵' }, { code: 'M19', name: '분말스프' },
    { code: 'M30', name: '즉석밥' }, { code: 'M31', name: 'FD' }
  ],
  epLoc: [
    { code: '2101', name: '제품냉동자동창고' }, { code: '2102', name: '제품냉장자동창고' }, { code: '2103', name: '제품상온자동창고' },
    { code: '2111', name: '조미식품재공품(HMR)' }, { code: '2112', name: '조리냉동재공품' },
    { code: '2121', name: '원료냉동자동창고' }, { code: '2122', name: '원료냉장창고' }, { code: '2123', name: '원료상온자동창고' },
    { code: '2124', name: '납미고(쌀)' }, { code: '2125', name: '분말원료창고' }, { code: '2126', name: '내포장창고' },
    { code: '2200', name: '생산실적창고*' },
    { code: '2801', name: '물류냉동자동창고' }, { code: '2802', name: '물류냉동수동창고' }, { code: '2803', name: '물류상온자동창고' },
    { code: '2901', name: 'FBH임시제품창고' }, { code: '2905', name: '외주(풀필먼트)' }, { code: '9000', name: '설비자재(정산용)' }
  ],
  supervisor: [
    { code: 'P01', name: '조리냉동, K3' }, { code: 'P02', name: '조미식품' }, { code: 'P03', name: '건면' },
    { code: 'P04', name: '유탕면' }, { code: 'P05', name: '건조야채' }, { code: 'P06', name: '즉석밥' },
    { code: 'P07', name: '분말스프' }
  ],
  temp: [
    { code: '1', name: '상온' }, { code: '2', name: '냉장' }, { code: '3', name: '냉동' }, { code: 'ZZ', name: '기타' }
  ],
  storage: [
    { code: '1', name: '상온제품' }, { code: '2', name: '냉장제품' }, { code: '3', name: '냉동제품' },
    { code: '4', name: '반제품' }, { code: '5', name: '상온원료' }, { code: '6', name: '냉장원료' }, { code: '7', name: '냉동원료' }
  ]
};